Tekla Open API Reference for Tekla Structures 2025
Operation.ObjectMatchesToFilter Method (ModelObject, String)
 Checks whether the object matches to the criteria in the given filter.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ObjectMatchesToFilter(
	ModelObject ModelObject,
	string FilterName
)
Public Shared Function ObjectMatchesToFilter (
	ModelObject As ModelObject,
	FilterName As String
) As Boolean
Parameters
ModelObject
Type: Tekla.Structures.Model.ModelObject
The model object to check.
FilterName
Type: System.String
The filter file to check against.
Return Value
Type: Boolean
True if the object matches to the given filter criteria.
Exceptions
Exception | Condition
ArgumentException | Thrown when the ModelObject is not valid.
See Also
Reference
Operation Class
ObjectMatchesToFilter Overload
Tekla.Structures.Model.Operations Namespace